; domain
(define (domain vampire)
    (:requirements :conditional-effects)
    (:predicates
        (light-on ?r)
        (slayer-is-alive)
        (slayer-is-in ?r)
        (vampire-is-alive)
        (vampire-is-in ?r)
        (fighting)
        ;
        ; static predicates
        (NEXT-ROOM ?r ?rn)
        (CONTAINS-GARLIC ?r)
        (changedLight)
    )
    (:action toggle-light
        :parameters (?anti-clockwise-neighbor ?room ?clockwise-neighbor)
        :precondition (and
            (NEXT-ROOM ?anti-clockwise-neighbor ?room)
            (NEXT-ROOM ?room ?clockwise-neighbor)
            (vampire-is-alive)
            (slayer-is-alive)
            (not (fighting))
        )
        :effect (and
            (not(changedLight))
            (when
                (light-on ?room)
                (and(not(light-on ?room))(changedLight)) ;switch off the light
            )
            (when
                (and(not(light-on ?room))(not(changedLight)))
                (and(light-on ?room)(changedLight)) ; switch on the light
            )
            (
                ;When the vampire is in a bright room and there isn't light in the anti-clockwise room -> vampire in anticlockwise room
                when
                (and(vampire-is-in ?room)(light-on ?room)(not(light-on ?anti-clockwise-neighbor))) 
                (and          
                    (not(vampire-is-in ?room))
                    (vampire-is-in ?anti-clockwise-neighbor)
                    ;Check if the slayer and vampire are in the same room -> begin fighting
                    (when
                        (and(slayer-is-in ?anti-clockwise-neighbor) (vampire-is-in ?anti-clockwise-neighbor))
                        (fighting)
                    )
                ) 
            )
            (
                ;When the vampire is in a bright room and there is light in the anti-clockwise room -> vampire in clockwise room
                when
                (and(vampire-is-in ?room)(light-on ?anti-clockwise-neighbor) (light-on ?room))
                (and
                    (not(vampire-is-in ?room))
                    (vampire-is-in ?clockwise-neighbor)
                    (when
                        (and(slayer-is-in ?clockwise-neighbor) (vampire-is-in ?clockwise-neighbor))
                        (fighting)
                    )
                )
            )
           
            (
                ;When the slayer is in a dark room and there is light in both neighbors -> slayer in anti-clockwise room
                when
                (and(slayer-is-in ?room)(not(light-on ?room))(light-on ?clockwise-neighbor)(light-on ?anti-clockwise-neighbor)) 
                (and
                    (not(slayer-is-in ?room))
                    (slayer-is-in ?anti-clockwise-neighbor)                 
                    (when
                        (and(slayer-is-in ?anti-clockwise-neighbor) (vampire-is-in ?anti-clockwise-neighbor))
                        (fighting)
                    )
                )
            )
            (
                ;When the slayer is in a dark room and there is light in clockwise neighbors -> slayer in clockwise room
                when
                (and(slayer-is-in ?room)(not(light-on ?room))(light-on ?clockwise-neighbor)) 
                (and(not(slayer-is-in ?room))(slayer-is-in ?clockwise-neighbor)
                    (when
                        (and(slayer-is-in ?clockwise-neighbor) (vampire-is-in ?clockwise-neighbor))
                        (fighting)
                    )
                )  
            )
           
            (
                ;When the slayer is in a dark room and there is light in anti-clockwise neighbors -> slayer in anti-clockwise room
                when
                (and(slayer-is-in ?room)(not(light-on ?room))(not(light-on ?clockwise-neighbor)))
                (and(not(slayer-is-in ?room))(slayer-is-in ?anti-clockwise-neighbor)
                (when
                    (and(slayer-is-in ?anti-clockwise-neighbor) (vampire-is-in ?anti-clockwise-neighbor))
                    (fighting)
                ))  
            )
            
        )
    )
   
   
   
    (:action watch-fight
        :parameters (?room)
        :precondition (and (slayer-is-in ?room) (vampire-is-in ?room) (slayer-is-alive) (vampire-is-alive) )
        :effect (and
            (
                when
                (and(light-on ?room ) ); when the light is on  
                (and(not(vampire-is-alive))(slayer-is-alive)) ; kill vampire, stop fighting
            )
            (
                when
                (and(CONTAINS-GARLIC ?room) ); when room cointains garlic
                (and(not(vampire-is-alive))(slayer-is-alive)) ; kill vampire, stop fighting
            )
            (
                when
                (and(not(light-on ?room))(not(CONTAINS-GARLIC ?room))) ; when the light is off and there is no garlic
                (and(not(slayer-is-alive))(vampire-is-alive)) ; kill slayer, stop fighting
            )
        )
    )
   
)

; problem
(define (problem p10)
(:domain vampire)
;
; Room1 Room2 Room3 Room4 Room5 Room6 Room7 Room8 Room9 Room10 Room11 Room12 Room13 Room14 Room15
; 1S    1     1     1     1     1     1     1V    1     1      1      1      1      1      1
;
(:objects
    room1
    room2
    room3
    room4
    room5
    room6
    room7
    room8
    room9
    room10
    room11
    room12
    room13
    room14
    room15
)
(:init
    (slayer-is-alive)
    (slayer-is-in room1)

    (vampire-is-alive)
    (vampire-is-in room8)

    (light-on room1)
    (light-on room2)
    (light-on room3)
    (light-on room4)
    (light-on room5)
    (light-on room6)
    (light-on room7)
    (light-on room8)
    (light-on room9)
    (light-on room10)
    (light-on room11)
    (light-on room12)
    (light-on room13)
    (light-on room14)
    (light-on room15)

    (NEXT-ROOM room1 room2)
    (NEXT-ROOM room2 room3)
    (NEXT-ROOM room3 room4)
    (NEXT-ROOM room4 room5)
    (NEXT-ROOM room5 room6)
    (NEXT-ROOM room6 room7)
    (NEXT-ROOM room7 room8)
    (NEXT-ROOM room8 room9)
    (NEXT-ROOM room9 room10)
    (NEXT-ROOM room10 room11)
    (NEXT-ROOM room11 room12)
    (NEXT-ROOM room12 room13)
    (NEXT-ROOM room13 room14)
    (NEXT-ROOM room14 room15)
    (NEXT-ROOM room15 room1)
)
(:goal (and
    (slayer-is-alive)
    (not (vampire-is-alive))
))
)

; plan
1. (toggle-light room15 room1 room2)
   deleted: (light-on room1)
   added: (changedlight)
   goals met: 1 of 2
2. (toggle-light room15 room1 room2)
   deleted: (changedlight) (slayer-is-in room1)
   added: (slayer-is-in room15) (slayer-is-in room2)
   goals met: 1 of 2
3. (toggle-light room14 room15 room1)
   deleted: (light-on room15)
   added: (changedlight)
   goals met: 1 of 2
4. (toggle-light room14 room15 room1)
   deleted: (changedlight) (slayer-is-in room15)
   added: (slayer-is-in room14)
   goals met: 1 of 2
5. (toggle-light room13 room14 room15)
   deleted: (light-on room14)
   added: (changedlight)
   goals met: 1 of 2
6. (toggle-light room13 room14 room15)
   deleted: (changedlight) (slayer-is-in room14)
   added: (slayer-is-in room13)
   goals met: 1 of 2
7. (toggle-light room10 room11 room12)
   deleted: (light-on room11)
   added: (changedlight)
   goals met: 1 of 2
8. (toggle-light room7 room8 room9)
   deleted: (light-on room8) (vampire-is-in room8)
   added: (vampire-is-in room9)
   goals met: 1 of 2
9. (toggle-light room12 room13 room14)
   deleted: (light-on room13)
   goals met: 1 of 2
10. (toggle-light room12 room13 room14)
   deleted: (changedlight) (slayer-is-in room13)
   added: (slayer-is-in room12)
   goals met: 1 of 2
11. (toggle-light room7 room8 room9)
   added: (light-on room8) (changedlight)
   goals met: 1 of 2
12. (toggle-light room8 room9 room10)
   deleted: (light-on room9) (vampire-is-in room9)
   added: (vampire-is-in room10)
   goals met: 1 of 2
13. (toggle-light room11 room12 room13)
   deleted: (light-on room12)
   goals met: 1 of 2
14. (toggle-light room11 room12 room13)
   deleted: (changedlight) (slayer-is-in room12)
   added: (slayer-is-in room11)
   goals met: 1 of 2
15. (toggle-light room10 room11 room12)
   deleted: (slayer-is-in room11)
   added: (light-on room11) (changedlight) (slayer-is-in room10)
   goals met: 1 of 2
16. (watch-fight room10)
   deleted: (vampire-is-alive)
   goals met: 2 of 2
